app/views/groups/_form.html.haml

          %p.chat-group-user__name= current_user.name
        - group.users.each do |user|
---
SELECT `users`.* FROM `users`