app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 8
---
  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'お読みください２.jpg', 7, 4, '2020-07-04 08:08:29', '2020-07-04 08:08:29')
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
---
  def create
    @message = @group.messages.new(message_params)
    if @message.save
      respond_to do |format|
        format.json
        format.html { redirect_to group_messages_path, notice: "メッセージを送信しました" }
      end
    else
      @messages = @group.messages.includes(:user)